Repository: naserhha/product-recommendation
Catalog: languages/product-recommendation-*.po
Languages: ar, fa, fa_ir

source: Enter form font color code.
ar: أدخل رمز لون خط النموذج.
fa: کد رنگ فونت فرم را وارد کنید.
fa_ir: کد رنگ فونت فرم را وارد کنید.

source: Form Button Color
fa: رنگ دکمه‌های فرم
fa_ir: رنگ دکمه فرم

source: #fff or #8c0101 or rgba(140,1,1,1)
ar: #fff أو #8c0101 أو rgba(140,1,1,1)
fa: #fff یا #8c0101 یا rgba(140,1,1,1)
fa_ir: #fff یا #8c0101 یا rgba(140,1,1,1)

source: Enter form button background color code.
ar: أدخل رمز لون خلفية زر النموذج.
fa: کد رنگ پس‌زمینه دکمه‌های فرم را وارد کنید.
fa_ir: کد رنگ پس‌زمینه دکمه فرم را وارد کنید.

source: Form Button Text Color
fa: رنگ متن دکمه‌های فرم
fa_ir: رنگ متن دکمه فرم

source: #8c0101 or #fff or rgba(140,1,1,1)
ar: #8c0101 أو #fff أو rgba(140,1,1,1)
fa: #8c0101 یا #fff یا rgba(140,1,1,1)
fa_ir: #8c0101 یا #fff یا rgba(140,1,1,1)

source: Enter form button text color code.
ar: أدخل رمز لون نص زر النموذج.
fa: کد رنگ متن دکمه‌های فرم را وارد کنید.
fa_ir: کد رنگ متن دکمه فرم را وارد کنید.

source: Save General Settings
ar: حفظ الإعدادات العامة
fa: ذخیره تنظیمات عمومی
fa_ir: ذخیره تنظیمات عمومی

source: Base questions reset to default for this language.
ar: تمت إعادة تعيين الأسئلة الأساسية إلى الوضع الافتراضي لهذه اللغة.
fa: سوالات پایه برای این زبان به حالت پیش‌فرض بازنشانی شد.
fa_ir: سوالات پایه برای این زبان به پیش‌فرض بازگردانده شده‌اند.

source: Question deleted.
ar: تم حذف السؤال.
fa: سوال حذف شد.
fa_ir: سوال حذف شد.

source: Question moved.
ar: تم نقل السؤال.
fa: سوال جابجا شد.
fa_ir: سوال جابجا شد.

source: Base questions saved.
ar: تم حفظ الأسئلة الأساسية.
fa: سوالات پایه ذخیره شد.
fa_ir: سوالات پایه ذخیره شد.

source: New question added.
ar: تم إضافة سؤال جديد.
fa: سوال جدید اضافه شد.
fa_ir: سوال جدید اضافه شد.

source: Select Language for Base Questions
ar: اختر اللغة للأسئلة الأساسية
fa: انتخاب زبان برای سوالات پایه
fa_ir: زبان سوالات پایه را انتخاب کنید

source: Current WordPress Language:
ar: لغة ووردبريس الحالية:
fa: زبان فعلی وردپرس:
fa_ir: زبان فعلی وردپرس:

source: Plugin Default Language:
fa: زبان پیش‌فرض افزونه:
fa_ir: زبان پیش‌فرض افزونه:

source: Default
ar: افتراضي
fa: پیش‌فرض
fa_ir: پیش‌فرض

source: Select the language to edit base questions for that language. The current WordPress language is automatically selected.
fa: زبان مورد نظر برای ویرایش سوالات پایه را انتخاب کنید. زبان فعلی وردپرس به طور خودکار انتخاب می‌شود.
fa_ir: زبانی را انتخاب کنید که برای آن سوالات پایه را ویرایش کنید. زبان فعلی وردپرس به طور خودکار انتخاب می‌شود.

source: Question Title
ar: عنوان السؤال
fa: عنوان سوال
fa_ir: عنوان سوال

source: WooCommerce Attribute
ar: سمة WooCommerce
fa: ویژگی ووکامرس
fa_ir: ویژگی WooCommerce

source: Options (one per line)
ar: الخيارات (واحد في كل سطر)
fa: گزینه‌ها (هر گزینه در یک خط)
fa_ir: گزینه‌ها (یک گزینه در هر خط)

source: Delete?
fa: حذف شود؟
fa_ir: حذف کنید؟

source: Delete
ar: حذف
fa: حذف
fa_ir: حذف

source: Up
ar: أعلى
fa: بالا
fa_ir: بالا

source: Down
fa: پایین
fa_ir: پایین

source: Save Base Questions
ar: حفظ الأسئلة الأساسية
fa: ذخیره سوالات پایه
fa_ir: ذخیره سوالات پایه

source: Add New Question
ar: إضافة سؤال جديد
fa: افزودن سوال جدید
fa_ir: سوال جدید اضافه کنید

source: Add Question
fa: افزودن سوال
fa_ir: سوال اضافه کنید

source: Reset Base Questions to Default for This Language
ar: إعادة تعيين الأسئلة الأساسية إلى الوضع الافتراضي لهذه اللغة
fa: بازنشانی سوالات پایه به حالت پیش‌فرض برای این زبان
fa_ir: پاسخ‌های سوالات پایه را برای این زبان به پیش‌فرض بازگردانید

source: In this section, you can manage the options for each feature (taxonomy). Adding, editing, and deleting options is only possible from this section, and access to WooCommerce's default management for these features is disabled.
fa: در این بخش می‌توانید گزینه‌های هر ویژگی (تکمیلی) را مدیریت کنید. اضافه کردن، ویرایش و حذف گزینه‌ها فقط از این بخش امکان‌پذیر است و دسترسی به مدیریت پیش‌فرض ووکامرس برای این ویژگی‌ها غیرفعال شده است.

source: Feature Name (taxonomy)
fa: نام ویژگی (تکمیلی)
fa_ir: نام ویژگی (تکوانیتی)

source: Title
fa: عنوان
fa_ir: عنوان

source: No options
fa: هیچ گزینه‌ای
fa_ir: گزینه‌ای نیست

source: Add
fa: افزودن
fa_ir: اضافه کنید

source: This list only displays features managed by the plugin.
fa: این لیست فقط ویژگی‌هایی را نمایش می‌دهد که توسط افزونه مدیریت می‌شوند.
fa_ir: این لیست فقط ویژگی‌های مدیریت شده توسط افزونه را نمایش می‌دهد.

source: Error:
fa: خطا:
fa_ir: خطا:

source: Afghanistan
fa: افغانستان
fa_ir: افغانستان

source: Tajikistan
fa: تاجیکستان
fa_ir: تاجیکستان

source: India
fa: هند
fa_ir: هند

source: Pakistan
fa: پاکستان
fa_ir: پاکستان

source: Nigeria
fa: نیجریه

source: Kenya
fa: کنیا
fa_ir: کنیا

source: Uganda
fa: اوگاندا
fa_ir: اوگاندا

source: Tanzania
fa: تانزانیا
fa_ir: تانزانیا

source: Zimbabwe
fa: زیمبابوه
fa_ir: زیمباوه

source: Philippines
fa: فیلیپین
fa_ir: فیلیپین

source: Malaysia
fa: مالزی
fa_ir: مالزی

source: How to Change Language
fa: نحوه تغییر زبان
fa_ir: نحوه تغییر زبان

source: To change the plugin language:
fa: برای تغییر زبان افزونه:
fa_ir: برای تغییر زبان افزونه:

source: Go to WordPress Admin → Settings → General
fa: به مدیریت وردپرس → تنظیمات → عمومی بروید
fa_ir: به پیشخوان وردپرس → تنظیمات → عمومی بروید

source: Change the "Site Language" setting to your desired language
fa: تنظیم "زبان سایت" را به زبان مورد نظر خود تغییر دهید
fa_ir: تنظیم "زبان سایت" را به زبان مورد نظر خود تغییر دهید

source: Language Information
fa: اطلاعات زبان
fa_ir: اطلاعات زبان

source: ✓ Languages match - Plugin will use current WordPress language
fa: ✓ زبان‌ها مطابقت دارند - افزونه از زبان فعلی وردپرس استفاده می‌کند
fa_ir: ✓ زبان‌ها مطابقت دارند - افزونه از زبان فعلی وردپرس استفاده خواهد کرد

source: ⚠ Languages differ - Plugin will use WordPress language, but default is different
fa: ⚠ زبان‌ها متفاوت هستند - افزونه از زبان وردپرس استفاده می‌کند، اما پیش‌فرض متفاوت است
fa_ir: ⚠ زبان‌ها متفاوت هستند - افزونه از زبان وردپرس استفاده خواهد کرد، اما پیش‌فرض متفاوت است

source: Product Recommendation System
fa: سیستم پیشنهاد محصول
fa_ir: سیستم توصیه محصول

source: Settings
ar: الإعدادات
fa: تنظیمات
fa_ir: تنظیمات

source: Product Characteristics
fa: ویژگی‌های محصول
fa_ir: ویژگی‌های محصول

source: Usage Guide
fa: راهنمای استفاده
fa_ir: راهنمای استفاده

source: To add a product recommendation form to any page or post, use the following shortcode:
fa: برای افزودن فرم پیشنهاد محصول به هر صفحه یا نوشته، از شورتکد زیر استفاده کنید:
fa_ir: برای افزودن فرم توصیه محصول به هر صفحه یا پست، از شورت‌کد زیر استفاده کنید:

source: How to configure products for recommendations
fa: نحوه تنظیم محصولات برای پیشنهادات
fa_ir: نحوه پیکربندی محصولات برای توصیه‌ها

source: Create a new product in WooCommerce.
fa: یک محصول جدید در ووکامرس ایجاد کنید.
fa_ir: یک محصول جدید در WooCommerce ایجاد کنید.

source: Form questions and their options are editable from the plugin settings section.
fa: سوالات فرم و گزینه‌های آن‌ها از بخش تنظیمات افزونه قابل ویرایش هستند.
fa_ir: سوالات فرم و گزینه‌های آن‌ها از بخش تنظیمات افزونه قابل ویرایش هستند.

source: How to Use the System
fa: نحوه استفاده از سیستم
fa_ir: نحوه استفاده از سیستم

source: No answers provided.
fa: هیچ پاسخی ارائه نشده است.
fa_ir: پاسخی ارائه نشده است.

source: Select an option
fa: یک گزینه را انتخاب کنید

source: Required field
fa: فیلد الزامی

source: Please fill out this field.
fa: لطفاً این فیلد را پر کنید.

source: Yes
fa: بله

source: No
fa: خیر

source: Back
fa: بازگشت

source: Finish
fa: پایان

source: No results found.
fa: نتیجه‌ای یافت نشد.

source: Search
fa: جستجو

source: Country
fa: کشور

source: Language
fa: زبان

source: Reset to default questions
fa: بازنشانی به سوالات پیش‌فرض

source: Save Changes
fa: ذخیره تغییرات

source: Product Recommendations
fa: پیشنهادات محصول

source: No recommendations found.
fa: هیچ پیشنهادی یافت نشد.

source: Submit
fa: ارسال

source: Cancel
fa: انصراف

source: How do you plan to use this product?
fa_ir: چگونه قصد استفاده از این محصول را دارید؟

source: What special features are important to you?
fa_ir: چه ویژگی‌های خاصی برای شما مهم است؟

source: Portable
fa_ir: قابل حمل

source: Multi-functional
fa_ir: چند منظوره

source: Recommended products for you:
fa_ir: محصولات توصیه شده برای شما:

source: Product Target
fa_ir: هدف محصول

source: Product Usage
fa_ir: استفاده محصول

source: Sample Product
fa_ir: محصول نمونه

source: Plugin default language has been updated to match the current WordPress language.
ar: تم تحديث اللغة الافتراضية للإضافة لتتطابق مع لغة ووردبريس الحالية.
fa_ir: زبان پیش‌فرض افزونه برای مطابقت با زبان فعلی وردپرس بروزرسانی شده است.

source: Language Support
ar: دعم اللغة
fa_ir: پشتیبانی زبان

source: Product Characteristics:
fa_ir: ویژگی‌های محصول:

source: to define different product characteristics
fa_ir: برای تعریف ویژگی‌های محصول متفاوت

source: to define occasions
fa_ir: برای تعریف رویدادها

source: to define suitable gender
fa_ir: برای تعریف جنسیت مناسب

source: to define quality levels
fa_ir: برای تعریف سطوح کیفیت

source: Usage:
fa_ir: استفاده:

source: to define different usages
fa_ir: برای تعریف استفاده‌های متفاوت

source: Go to the Plugin Features tab and add options
fa_ir: به بخش ویژگی‌های افزونه و گزینه‌ها را اضافه کنید.

source: No product is displayed:
fa_ir: محصولی نمایش داده نشد:

source: Check product characteristics
fa_ir: ویژگی‌های محصول را بررسی کنید.

source: Colors are not correct:
fa_ir: رنگ‌ها صحیح نیست:

source: Check general settings
fa_ir: تنظیمات عمومی را بررسی کنید.

source: Form is not displayed:
fa_ir: فرم نمایش داده نشد:

source: Check the shortcode
fa_ir: شورت‌کد را بررسی کنید.

source: WordPress language setting. The following languages and countries are fully supported:
fa_ir: این افزونه چند زبان پشتیبانی می‌کند و به طور خودکار با زبان وردپرس شما منطبق می‌شود. زبان‌ها و کشورهای زیر به طور کامل پشتیبانی می‌شوند:

source: WordPress language is set to one of the supported languages, the plugin will automatically use that language for all text and interface elements.
fa_ir: افزونه به طور خودکار زبان وردپرس شما را شناسایی می‌کند و تمام عناصر رابط کاربری، سوالات و گزینه‌ها را مطابق آن تنظیم می‌کند. اگر زبان وردپرس شما یکی از زبان‌های پشتیبانی‌شده باشد، افزونه به طور خودکار از آن زبان برای تمام متن‌ها و عناصر رابط کاربری استفاده خواهد کرد.

source: Plugin Features (Taxonomy)
fa_ir: ویژگی‌های افزونه (تکوانیتی)

source: In this section, you can manage the options for each feature (taxonomy). Adding, editing, and removing options is only possible from this section, and access to WooCommerce's default management for these features is disabled.
fa_ir: در این بخش، می‌توانید گزینه‌های هر ویژگی (تکوانیتی) را مدیریت کنید. اضافه کردن، ویرایش و حذف گزینه‌ها فقط از این بخش امکان‌پذیر است و دسترسی به مدیریت پیش‌فرض WooCommerce برای این ویژگی‌ها غیرفعال شده است.

source: Options (terms)
fa_ir: گزینه‌ها (ترم)

source: Add new option...
fa_ir: گزینه جدید اضافه کنید...

source: New option added.
fa_ir: گزینه جدید اضافه شد.

source: Feature '%s' (taxonomy: %s) created successfully.
fa_ir: ویژگی '%s' (تکسانومی: %s) با موفقیت ایجاد شد.

source: Option '%s' added to feature '%s'.
fa_ir: گزینه '%s' به ویژگی '%s' افزوده شد.

source: Error adding option '%s' to feature '%s': %s
fa_ir: خطا در افزودن گزینه '%s' به ویژگی '%s': %s

source: Option deleted.
fa_ir: گزینه حذف شد.

source: Option updated successfully.
fa_ir: ویرایش گزینه با موفقیت انجام شد.

source: Save the changes
fa_ir: تغییرات را ذخیره کنید

source: The plugin will automatically adapt to the new language
fa_ir: افزونه به طور خودکار با زبان جدید سازگار خواهد شد

source: Update Plugin Default Language to Match WordPress
fa_ir: بروزرسانی زبان پیش‌فرض افزونه برای مطابقت با وردپرس

source: To enable a product in the product recommendation system:
fa_ir: برای فعال‌سازی محصول در سیستم توصیه محصول:

source: In the Product Characteristics section, select appropriate values.
fa_ir: در بخش ویژگی‌های محصول، مقادیر مناسب را انتخاب کنید.

source: Publish the product.
fa_ir: محصول را منتشر کنید.

source: Don't forget to set the product characteristics for this product to enable it in the recommendation system.
fa_ir: فراموش نکنید که ویژگی‌های محصول را برای این محصول تنظیم کنید تا در سیستم توصیه فعال شود.

source: Product Recommendation System Guide
fa_ir: راهنمای سیستم توصیه محصول

source: The product recommendation system allows you to suggest appropriate products based on user characteristics.
fa_ir: سیستم توصیه محصول به شما امکان می‌دهد تا بر اساس ویژگی‌های کاربر، محصولات مناسب را پیشنهاد دهید.

source: Setup Steps:
fa_ir: مراحل راه‌اندازی:

source: Enable Plugin:
fa_ir: فعال‌سازی افزونه:

source: Activate the plugin in WordPress.
fa_ir: افزونه را در وردپرس فعال کنید.

source: Configure Products:
fa_ir: پیکربندی محصولات:

source: For each product, set appropriate characteristics in the 'Product Characteristics' section.
fa_ir: برای هر محصول، ویژگی‌های مناسب را در بخش 'ویژگی‌های محصول' تنظیم کنید.

source: Add Form:
fa_ir: افزودن فرم:

source: Place the shortcode [product_recommendation_form] on the desired page or post.
fa_ir: شورت‌کد [product_recommendation_form] را در صفحه یا پست مورد نظر قرار دهید.

source: Customize:
fa_ir: شخصی‌سازی:

source: Personalize the form appearance from the settings section.
fa_ir: ظاهر فرم را از بخش تنظیمات شخصی‌سازی کنید.

source: To enable a product in the recommendation system:
fa_ir: برای فعال‌سازی محصول در سیستم توصیه:

source: Go to the WooCommerce products section.
fa_ir: به بخش محصولات WooCommerce بروید.

source: Edit the desired product.
fa_ir: محصول مورد نظر را ویرایش کنید.

source: In the 'Product Characteristics' section, select appropriate values.
fa_ir: در بخش 'ویژگی‌های محصول'، مقادیر مناسب را انتخاب کنید.

source: Shortcodes:
fa_ir: شورت‌کدها:

source: Product recommendation form
fa_ir: فرم توصیه محصول

source: Support:
fa_ir: پشتیبانی:

source: For support or to report issues, contact the development team.
fa_ir: برای پشتیبانی یا گزارش مشکلات، با تیم توسعه تماس بگیرید.

source: Here are your recommended products:
fa_ir: محصولات توصیه شده شما:

source: Translation Debug
ar: تصحيح الترجمة
fa_ir: دیباگ ترجمه

source: Translation Debug Information
ar: معلومات تصحيح الترجمة
fa_ir: اطلاعات دیباگ ترجمه

source: Available Translation Files
ar: ملفات الترجمة المتاحة
fa_ir: فایل‌های ترجمه موجود

source: No .mo files found.
ar: لم يتم العثور على ملفات .mo.
fa_ir: هیچ فایل .mo یافت نشد.

source: English
ar: الإنجليزية
