Repository: naserhha/product-recommendation
Catalog: languages/product-recommendation-*.po
Languages: ar, fa, fa_ir

source: What type of product are you looking for?
fa: چه نوع محصولی را می‌خواهید؟
fa_ir: چه نوع محصولی را جستجو می‌کنید؟

source: Clothing
ar: الملابس
fa: پوشاک
fa_ir: پوشاک

source: Digital Accessories
fa: لوازم دیجیتال
fa_ir: لوازم جانبی دیجیتال

source: Home Appliances
ar: الأجهزة المنزلية
fa: لوازم خانگی
fa_ir: لوازم خانگی

source: Beauty & Health
ar: الجمال والصحة
fa: آرایشی و بهداشتی
fa_ir: زیبایی و سلامت

source: Books
ar: الكتب
fa: کتاب
fa_ir: کتاب‌ها

source: Other
ar: أخرى
fa: سایر
fa_ir: سایر

source: What is your preferred price range?
fa: محدوده قیمتی مورد نظر شما چیست؟
fa_ir: محدوده قیمت مورد نظر شما چیست؟

source: Less than 500 thousand Tomans
ar: أقل من 500 ألف ريال سعودي
fa: کمتر از ۵۰۰ هزار تومان
fa_ir: کمتر از ۵۰۰ هزار تومان

source: 500 thousand to 2 million Tomans
ar: من 500 ألف إلى 2 مليون ريال سعودي
fa: ۵۰۰ تا ۲ میلیون تومان
fa_ir: ۵۰۰ هزار تا ۲ میلیون تومان

source: More than 2 million Tomans
ar: أكثر من 2 مليون ريال سعودي
fa: بیش از ۲ میلیون تومان
fa_ir: بیش از ۲ میلیون تومان

source: Who is this product for?
ar: لمن هذا المنتج؟
fa: این محصول برای چه کسی است؟
fa_ir: این محصول برای چه کسی است؟

source: Myself
ar: نفسي
fa: خودم
fa_ir: خودم

source: Family members
fa: اعضای خانواده
fa_ir: اعضای خانواده

source: Gift for friend
fa: هدیه برای دوست
fa_ir: هدیه برای دوست

source: Child
ar: طفل
fa: کودک
fa_ir: کودک

source: Teenager
ar: مراهق
fa: نوجوان
fa_ir: نوجوان

source: Adult
ar: بالغ
fa: بزرگسال
fa_ir: بزرگسال

source: What style and color do you prefer?
ar: ما النمط واللون الذي تفضله؟
fa: چه استایل و رنگی را ترجیح می‌دهید؟
fa_ir: چه سبک و رنگی را ترجیح می‌دهید؟

source: Light colors
fa: رنگ‌های روشن
fa_ir: رنگ‌های روشن

source: Dark colors
fa: رنگ‌های تیره
fa_ir: رنگ‌های تیره

source: Classic
ar: كلاسيكي
fa: کلاسیک
fa_ir: کلاسیک

source: Modern
ar: حديث
fa: مدرن
fa_ir: مدرن

source: Sporty
fa: اسپرت
fa_ir: ورزشی

source: What is this product for?
fa: این محصول برای چه کاربردی است؟

source: Daily use
fa: استفاده روزمره
fa_ir: استفاده روزانه

source: Party
ar: حفلة
fa: مهمانی
fa_ir: مهمانی

source: Workplace
fa: محل کار
fa_ir: محل کار

source: Travel
ar: السفر
fa: سفر
fa_ir: سفر

source: Sports
fa: ورزش
fa_ir: ورزش

source: What special feature are you looking for?
ar: ما الميزة الخاصة التي تبحث عنها؟
fa: چه ویژگی خاصی مد نظر شماست؟

source: High build quality
ar: جودة تصنيع عالية
fa: کیفیت ساخت بالا
fa_ir: کیفیت ساخت بالا

source: Reputable brand
fa: برند معتبر
fa_ir: برند معتبر

source: Low energy consumption
fa: مصرف انرژی کم
fa_ir: مصرف انرژی کم

source: Portability
fa: قابلیت حمل

source: Multi-functionality
ar: متعدد الوظائف
fa: چندکاره بودن

source: No options defined for this question. Please add options from WooCommerce attributes or plugin settings.
ar: لم يتم تحديد خيارات لهذا السؤال. يرجى إضافة الخيارات من خصائص WooCommerce أو إعدادات الإضافة.
fa: هیچ گزینه‌ای برای این سوال تعریف نشده است. لطفاً گزینه‌ها را از ویژگی‌های ووکامرس یا تنظیمات افزونه اضافه کنید.

source: Previous
ar: السابق
fa: قبلی
fa_ir: قبلی

source: Next
ar: التالي
fa: بعدی
fa_ir: بعدی

source: Get Recommendations
fa: دریافت پیشنهادات
fa_ir: دریافت توصیه‌ها

source: View Details
ar: عرض التفاصيل
fa: مشاهده جزئیات
fa_ir: مشاهده جزئیات

source: Add to Cart
ar: أضف إلى السلة
fa: افزودن به سبد خرید
fa_ir: افزودن به سبد خرید

source: Product Category
ar: فئة المنتج
fa: دسته‌بندی محصول
fa_ir: دسته‌بندی محصول

source: Price Range
ar: نطاق السعر
fa: محدوده قیمتی
fa_ir: محدوده قیمت

source: Style and Color
ar: النمط واللون
fa: سبک و رنگ
fa_ir: سبک و رنگ

source: Special Feature
ar: الميزة الخاصة
fa: ویژگی خاص
fa_ir: ویژگی خاص

source: This is a sample product
ar: هذا منتج تجريبي
fa: این یک محصول نمونه است
fa_ir: این یک محصول نمونه است

source: Please add real products to the store.
ar: يرجى إضافة منتجات حقيقية إلى المتجر.
fa: لطفاً محصولات واقعی را به فروشگاه اضافه کنید.
fa_ir: لطفاً محصولات واقعی را به فروشگاه اضافه کنید.

source: Contact for price
ar: اتصل لمعرفة السعر
fa: تماس برای قیمت
fa_ir: برای اطلاع از قیمت تماس بگیرید

source: Error processing request:
ar: حدث خطأ أثناء معالجة الطلب:
fa: خطا در پردازش درخواست:
fa_ir: خطا در پردازش درخواست:

source: Loading...
ar: جاري التحميل...
fa: در حال بارگذاری...
fa_ir: در حال بارگذاری...

source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
fa: خطایی رخ داد. لطفاً دوباره تلاش کنید.
fa_ir: خطایی رخ داد. لطفاً دوباره تلاش کنید.

source: No products found matching your criteria.
ar: لم يتم العثور على منتجات تطابق معاييرك.
fa: هیچ محصولی با مشخصات شما یافت نشد.
fa_ir: هیچ محصولی مطابق معیارهای شما یافت نشد.

source: Product Recommendation
fa: پیشنهاد محصول
fa_ir: توصیه محصول

source: Please answer a few short questions so we can recommend the right product for you
ar: يرجى الإجابة على بعض الأسئلة القصيرة حتى نتمكن من التوصية بالمنتج المناسب لك.
fa: لطفاً به چند سوال کوتاه پاسخ دهید تا محصول مناسب شما را پیشنهاد دهیم
fa_ir: لطفاً به چند سوال کوتاه پاسخ دهید تا بتوانیم محصول مناسب را برای شما توصیه کنیم

source: Category
fa: دسته‌بندی
fa_ir: دسته‌بندی

source: Price
fa: قیمت
fa_ir: قیمت

source: Target
ar: الفئة المستهدفة
fa: مخاطب
fa_ir: هدف

source: Style
ar: النمط
fa: استایل و رنگ
fa_ir: سبک

source: Usage
ar: الاستخدام
fa: کاربرد محصول
fa_ir: استفاده

source: Feature
fa: ویژگی
fa_ir: ویژگی

source: Processing...
fa: در حال پردازش...
fa_ir: در حال پردازش...

source: Plugin feature management is only done through this page. Plugin-related links have been removed from other dashboard sections.
fa: مدیریت ویژگی‌های افزونه فقط از طریق این صفحه انجام می‌شود. لینک‌های مربوط به افزونه از سایر بخش‌های پیشخوان حذف شده‌اند.
fa_ir: مدیریت ویژگی‌های افزونه فقط از طریق این صفحه انجام می‌شود. پیوندهای مربوط به افزونه از سایر بخش‌های داشبورد حذف شده‌اند.

source: Guide
ar: الدليل
fa: راهنما
fa_ir: راهنما

source: General Settings
ar: الإعدادات العامة
fa: تنظیمات عمومی
fa_ir: تنظیمات عمومی

source: Base Questions
ar: الأسئلة الأساسية
fa: سوالات پایه
fa_ir: سوالات پایه

source: Plugin Features
ar: ميزات الإضافة
fa: ویژگی‌های افزونه
fa_ir: ویژگی‌های افزونه

source: Complete Guide to Using the Product Recommendation Plugin
ar: الدليل الكامل لاستخدام إضافة توصية المنتجات
fa: راهنمای کامل استفاده از افزونه پیشنهاد محصول
fa_ir: راهنمای کامل استفاده از افزونه توصیه محصول

source: Step 1: Configure Base Questions
ar: الخطوة 1: تكوين الأسئلة الأساسية
fa: مرحله ۱: تنظیم سوالات پایه
fa_ir: مرحله 1: پیکربندی سوالات پایه

source: Go to the Base Questions tab
ar: انتقل إلى تبويب الأسئلة الأساسية
fa: به تب سوالات پایه بروید
fa_ir: به بخش سوالات پایه بروید

source: Review the default questions (product category, price range, target audience, style, usage, special feature)
ar: راجع الأسئلة الافتراضية (فئة المنتج، نطاق السعر، الجمهور المستهدف، النمط، الاستخدام، الميزة الخاصة)
fa: سوالات پیش‌فرض را بررسی کنید (دسته‌بندی محصول، محدوده قیمتی، مخاطب، استایل، کاربرد، ویژگی خاص)
fa_ir: پیش‌فرض سوالات را بررسی کنید (دسته‌بندی محصول، محدوده قیمت، هدف، سبک، استفاده، ویژگی خاص)

source: Edit question titles if needed
ar: حرر عناوين الأسئلة إذا لزم الأمر
fa: در صورت نیاز، عنوان سوالات را ویرایش کنید
fa_ir: اگر نیاز به ویرایش عنوان سوال دارید، آنها را ویرایش کنید.

source: Enter options for each question in the relevant section (one option per line)
ar: أدخل الخيارات لكل سؤال في القسم ذي الصلة (خيار واحد لكل سطر)
fa: گزینه‌های هر سوال را در قسمت مربوطه وارد کنید (هر گزینه در یک خط)
fa_ir: در بخش مربوطه برای هر سوال، گزینه‌ها را وارد کنید (یک گزینه در هر خط)

source: To add a new question, use the 'Add New Question' section
ar: لإضافة سؤال جديد، استخدم قسم 'إضافة سؤال جديد'
fa: برای افزودن سوال جدید، از بخش «افزودن سوال جدید» استفاده کنید
fa_ir: برای اضافه کردن سوال جدید، بخش 'اضافه کردن سوال جدید' را استفاده کنید.

source: Click the Save Base Questions button
ar: انقر على زر حفظ الأسئلة الأساسية
fa: دکمه ذخیره سوالات پایه را کلیک کنید
fa_ir: دکمه ذخیره سوالات پایه را کلیک کنید.

source: Step 2: Customize Form Appearance
ar: الخطوة 2: تخصيص مظهر النموذج
fa: مرحله ۲: تنظیم ظاهر فرم
fa_ir: مرحله 2: طراحی کردن فرم

source: Go to the General Settings tab
ar: انتقل إلى تبويب الإعدادات العامة
fa: به تب تنظیمات عمومی بروید
fa_ir: به بخش تنظیمات عمومی بروید

source: Check that the plugin is enabled (should be checked)
ar: تأكد من أن الإضافة مفعلة (يجب أن تكون محددة)
fa: فعال‌سازی افزونه را بررسی کنید (باید تیک خورده باشد)
fa_ir: تأیید کنید که افزونه فعال است (باید چک شود).

source: Enter a custom message if needed
ar: أدخل رسالة مخصصة إذا لزم الأمر
fa: پیام سفارشی را در صورت نیاز وارد کنید
fa_ir: اگر نیاز به پیام سفارشی دارید، آن را وارد کنید.

source: Set the primary plugin color (example: #8c0101)
ar: اضبط اللون الأساسي للإضافة (مثال: #8c0101)
fa: رنگ اصلی افزونه را تنظیم کنید (مثال: #8c0101)
fa_ir: رنگ اصلی افزونه را تنظیم کنید (مثال: #8c0101).

source: Choose the form font color (example: #fff for white)
ar: اختر لون خط النموذج (مثال: #fff للأبيض)
fa: رنگ فونت فرم را انتخاب کنید (مثال: #fff برای سفید)
fa_ir: رنگ فونت فرم را انتخاب کنید (مثال: #fff برای سفید).

source: Set button colors and button text colors
ar: اضبط ألوان الأزرار وألوان نص الأزرار
fa: رنگ دکمه‌ها و متن دکمه‌ها را تنظیم کنید
fa_ir: رنگ دکمه‌ها و رنگ متن دکمه‌ها را تنظیم کنید.

source: Click the Save General Settings button
ar: انقر على زر حفظ الإعدادات العامة
fa: دکمه ذخیره تنظیمات عمومی را کلیک کنید
fa_ir: دکمه ذخیره تنظیمات عمومی را کلیک کنید.

source: Step 3: Manage Product Characteristics
ar: الخطوة 3: إدارة خصائص المنتج
fa: مرحله ۳: مدیریت ویژگی‌های محصول
fa_ir: مرحله 3: مدیریت ویژگی‌های محصول

source: Go to the Plugin Features tab
ar: انتقل إلى تبويب ميزات الإضافة
fa: به تب ویژگی‌های افزونه بروید
fa_ir: به بخش ویژگی‌های افزونه بروید

source: View the list of all available characteristics
ar: عرض قائمة جميع الخصائص المتاحة
fa: لیست تمام ویژگی‌های موجود را مشاهده کنید
fa_ir: لیست کامل ویژگی‌های قابل دسترس را مشاهده کنید.

source: For each characteristic, review the available options
ar: لكل خاصية، راجع الخيارات المتاحة
fa: برای هر ویژگی، گزینه‌های موجود را بررسی کنید
fa_ir: برای هر ویژگی، گزینه‌های موجود را بررسی کنید.

source: Add new options if needed
ar: أضف خيارات جديدة إذا لزم الأمر
fa: در صورت نیاز، گزینه جدید اضافه کنید
fa_ir: اگر نیاز به گزینه جدید دارید، آنها را اضافه کنید.

source: Remove unnecessary options
ar: احذف الخيارات غير الضرورية
fa: گزینه‌های غیرضروری را حذف کنید
fa_ir: گزینه‌های غیرضروری را حذف کنید.

source: Or use separate submenus to manage each characteristic:
ar: أو استخدم القوائم الفرعية المنفصلة لإدارة كل خاصية:
fa: یا از زیرمنوهای جداگانه برای مدیریت هر ویژگی استفاده کنید:
fa_ir: یا از زیرمنوهای جداگانه برای مدیریت هر ویژگی استفاده کنید:

source: Suitable For:
ar: مناسب لـ:
fa: مناسب برای:
fa_ir: مناسب برای:

source: Suitable Season:
ar: الموسم المناسب:
fa: فصل مناسب:
fa_ir: فصل مناسب:

source: Gender:
ar: الجنس:
fa: جنسیت:
fa_ir: جنسیت:

source: Quality:
ar: الجودة:
fa: کیفیت:
fa_ir: کیفیت:

source: Step 4: Configure Products
ar: الخطوة 4: تكوين المنتجات
fa: مرحله ۴: تنظیم محصولات
fa_ir: مرحله 4: پیکربندی محصولات

source: Go to Products > All Products
ar: انتقل إلى المنتجات > جميع المنتجات
fa: به بخش محصولات > همه محصولات بروید
fa_ir: به بخش محصولات > تمام محصولات بروید

source: Click on the desired product to edit it
ar: انقر على المنتج المطلوب لتحريره
fa: روی محصول مورد نظر کلیک کنید تا ویرایش شود
fa_ir: محصول مورد نظر را برای ویرایش کلیک کنید.

source: In the Product Characteristics section (located at the bottom of the product page):
ar: في قسم خصائص المنتج (يقع في أسفل صفحة المنتج):
fa: در بخش ویژگی‌های محصول (که در پایین صفحه محصول قرار دارد):
fa_ir: در بخش ویژگی‌های محصول (در پایین صفحه محصول):

source: For each base question, select the appropriate option:
ar: لكل سؤال أساسي، اختر الخيار المناسب:
fa: برای هر سوال پایه، گزینه مناسب را انتخاب کنید:
fa_ir: برای هر سوال پایه، گزینه مناسب را انتخاب کنید:

source: Product Category: Clothing, Digital Accessories, Home Appliances, Beauty & Health, Books, Other
ar: فئة المنتج: الملابس، الملحقات الرقمية، الأجهزة المنزلية، الجمال والصحة، الكتب، أخرى
fa: دسته‌بندی محصول: پوشاک، لوازم دیجیتال، لوازم خانگی، آرایشی و بهداشتی، کتاب، سایر
fa_ir: دسته‌بندی محصول: پوشاک، لوازم جانبی دیجیتال، لوازم خانگی، زیبایی و سلامت، کتاب‌ها، سایر

source: Price Range: Less than 500 thousand Tomans, 500 thousand to 2 million Tomans, More than 2 million Tomans
ar: نطاق السعر: أقل من 500 ألف ريال سعودي، 500 ألف إلى 2 مليون ريال سعودي، أكثر من 2 مليون ريال سعودي
fa: محدوده قیمتی: کمتر از ۵۰۰ هزار تومان، ۵۰۰ تا ۲ میلیون تومان، بیش از ۲ میلیون تومان
fa_ir: محدوده قیمت: کمتر از ۵۰۰ هزار تومان، ۵۰۰ هزار تا ۲ میلیون تومان، بیش از ۲ میلیون تومان

source: Target Audience: Myself, Family members, Gift for friend, Child, Teenager, Adult
ar: الجمهور المستهدف: أنا، أفراد العائلة، هدية لصديق، طفل، مراهق، بالغ
fa: مخاطب: خودم، اعضای خانواده، هدیه برای دوست، کودک، نوجوان، بزرگسال
fa_ir: هدف محصول: خودم، اعضای خانواده، هدیه برای دوست، کودک، نوجوان، بزرگسال

source: Style: Bright colors, Dark colors, Classic, Modern, Sporty
ar: النمط: ألوان زاهية، ألوان داكنة، كلاسيكي، عصري، رياضي
fa: استایل: رنگ‌های روشن، رنگ‌های تیره، کلاسیک، مدرن، اسپرت
fa_ir: سبک: رنگ‌های روشن، رنگ‌های تیره، کلاسیک، مدرن، ورزشی

source: Usage: Daily use, Party, Workplace, Travel, Sports
ar: الاستخدام: الاستخدام اليومي، الحفلات، مكان العمل، السفر، الرياضة
fa: کاربرد: استفاده روزمره، مهمانی، محل کار، سفر، ورزش
fa_ir: استفاده: استفاده روزانه، مهمانی، محل کار، سفر، ورزش

source: Special Feature: High build quality, Reputable brand, Low energy consumption, Portable, Multi-functional
ar: الميزة الخاصة: جودة بناء عالية، علامة تجارية موثوقة، استهلاك طاقة منخفض، قابل للحمل، متعدد الوظائف
fa: ویژگی خاص: کیفیت ساخت بالا، برند معتبر، مصرف انرژی کم، قابلیت حمل، چندکاره بودن
fa_ir: ویژگی خاص: کیفیت ساخت بالا، برند معتبر، مصرف انرژی کم، قابل حمل، چند منظوره

source: Also configure other product characteristics (features, occasions, seasons, etc.)
ar: أيضاً قم بتكوين خصائص المنتج الأخرى (الميزات، المناسبات، المواسم، إلخ)
fa: سایر ویژگی‌های محصول را نیز تنظیم کنید (ویژگی‌ها، مناسبت، فصل و...)
fa_ir: همچنین ویژگی‌های محصول دیگر را پیکربندی کنید (ویژگی‌ها، رویدادها، فصل‌ها، و غیره).

source: Save the product
ar: احفظ المنتج
fa: محصول را ذخیره کنید
fa_ir: محصول را ذخیره کنید.

source: Repeat this process for all products you want to display in the form
ar: كرر هذه العملية لجميع المنتجات التي تريد عرضها في النموذج
fa: این کار را برای تمام محصولاتی که می‌خواهید در فرم نمایش داده شوند تکرار کنید.
fa_ir: برای نمایش همه محصولاتی که در فرم نمایش داده می‌شوند، این فرآیند را تکرار کنید.

source: Step 5: Place the Form on Your Site
ar: الخطوة 5: وضع النموذج على موقعك
fa: مرحله ۵: قرار دادن فرم در سایت
fa_ir: مرحله 5: قرار دادن فرم در سایت شما

source: Go to Pages > Add New Page
ar: انتقل إلى الصفحات > إضافة صفحة جديدة
fa: به بخش صفحات > افزودن صفحه جدید بروید
fa_ir: به بخش صفحات > اضافه کردن صفحه جدید بروید

source: Enter the page title (example: Product Recommendation)
ar: أدخل عنوان الصفحة (مثال: توصية المنتجات)
fa: عنوان صفحه را وارد کنید (مثال: پیشنهاد محصول)
fa_ir: عنوان صفحه را وارد کنید (مثال: توصیه محصول).

source: In the page content, place the following shortcode:
ar: في محتوى الصفحة، ضع الشيفرة القصيرة التالية:
fa: در محتوای صفحه، شورتکد زیر را قرار دهید:
fa_ir: در محتوای صفحه، شورت‌کد زیر را قرار دهید:

source: Publish the page
ar: انشر الصفحة
fa: صفحه را انتشار دهید
fa_ir: صفحه را منتشر کنید.

source: Or place the same shortcode in any other page or post where you want the form to appear
ar: أو ضع نفس الشيفرة القصيرة في أي صفحة أو مقالة أخرى تريد أن يظهر فيها النموذج
fa: یا در هر برگه یا نوشته دیگری که می‌خواهید فرم نمایش داده شود، همین شورتکد را قرار دهید
fa_ir: یا شورت‌کد یکسان را در هر صفحه یا پست دیگری که می‌خواهید فرم نمایش داده شود قرار دهید.

source: Step 6: Test Functionality
ar: الخطوة 6: اختبار الوظائف
fa: مرحله ۶: تست عملکرد
fa_ir: مرحله 6: آزمون کارایی

source: Go to the page where you placed the form
ar: انتقل إلى الصفحة التي وضعت فيها النموذج
fa: به صفحه‌ای که فرم را قرار داده‌اید بروید
fa_ir: به صفحه‌ای که فرم را قرار داده‌اید بروید.

source: View the form and make sure questions and options are displayed correctly
ar: عرض النموذج وتأكد من أن الأسئلة والخيارات معروضة بشكل صحيح
fa: فرم را مشاهده کنید و مطمئن شوید که سوالات و گزینه‌ها به درستی نمایش داده می‌شوند
fa_ir: فرم را مشاهده کنید و مطمئن شوید سوالات و گزینه‌ها به درستی نمایش داده شده‌اند.

source: Fill out the form and try different responses
ar: املأ النموذج وجرب ردود مختلفة
fa: فرم را پر کنید و پاسخ‌های مختلف را امتحان کنید
fa_ir: فرم را پر کنید و پاسخ‌های مختلف را امتحان کنید.

source: Check that recommended products are displayed
ar: تحقق من أن المنتجات الموصى بها معروضة
fa: بررسی کنید که محصولات پیشنهادی نمایش داده می‌شوند
fa_ir: تأیید کنید که محصولات توصیه شده نمایش داده شده‌اند.

source: If no product is displayed, check that the product characteristics are set correctly
ar: إذا لم يتم عرض أي منتج، تحقق من أن خصائص المنتج مضبوطة بشكل صحيح
fa: اگر محصولی نمایش داده نمی‌شود، بررسی کنید که ویژگی‌های آن محصول به درستی تنظیم شده باشد
fa_ir: اگر محصولی نمایش داده نشد، تأیید کنید که ویژگی‌های محصول به درستی تنظیم شده‌اند.

source: Troubleshooting Common Issues
ar: استكشاف الأخطاء الشائعة
fa: عیب‌یابی مشکلات رایج
fa_ir: رفع مشکلات متداول

source: Question options are empty:
ar: خيارات السؤال فارغة:
fa: گزینه‌های سوال خالی است:
fa_ir: گزینه‌های سوال خالی است:

source: Important Notes
ar: ملاحظات مهمة
fa: نکات مهم
fa_ir: یادداشت‌های مهم

source: All characteristic management and plugin options are done only through this page
ar: جميع إدارة الخصائص وخيارات الإضافة تتم فقط من خلال هذه الصفحة
fa: تمام مدیریت ویژگی‌ها و گزینه‌های افزونه فقط از طریق این صفحه انجام می‌شود
fa_ir: تمام مدیریت ویژگی‌ها و گزینه‌های افزونه فقط از طریق این صفحه انجام می‌شود.

source: Plugin-related links have been removed from other admin sections
ar: تم إزالة الروابط المتعلقة بالإضافة من أقسام الإدارة الأخرى
fa: لینک‌های مربوط به افزونه از سایر بخش‌های پیشخوان حذف شده‌اند
fa_ir: پیوندهای مربوط به افزونه از سایر بخش‌های مدیریت ادمین حذف شده‌اند.

source: For best results, configure at least 6 products with different characteristics
ar: للحصول على أفضل النتائج، قم بتكوين 6 منتجات على الأقل بخصائص مختلفة
fa: برای بهترین نتیجه، حداقل ۶ محصول با ویژگی‌های مختلف تنظیم کنید
fa_ir: برای بهترین نتیجه، حداقل 6 محصول با ویژگی‌های متفاوت پیکربندی کنید.

source: Product characteristics must match question options
ar: يجب أن تتطابق خصائص المنتج مع خيارات السؤال
fa: ویژگی‌های محصولات باید با گزینه‌های سوالات مطابقت داشته باشند
fa_ir: ویژگی‌های محصول باید با گزینه‌های سوال مطابقت داشته باشد.

source: The form automatically adapts to your settings
ar: النموذج يتكيف تلقائياً مع إعداداتك
fa: فرم به صورت خودکار با تنظیمات شما هماهنگ می‌شود
fa_ir: فرم به تنظیمات خودتان به طور خودکار منطبق خواهد شد.

source: Supported Languages and Countries
ar: اللغات والدول المدعومة
fa: زبان‌ها و کشورهای پشتیبانی‌شده

source: This plugin supports multiple languages and automatically adapts to your WordPress language setting. The following languages and countries are fully supported:
ar: يدعم هذا المكون الإضافي لغات متعددة ويتكيف تلقائيًا مع إعداد لغة ووردبريس الخاصة بك. اللغات والدول التالية مدعومة بالكامل:
fa: این افزونه از چندین زبان پشتیبانی می‌کند و به صورت خودکار با تنظیمات زبان وردپرس شما هماهنگ می‌شود. زبان‌ها و کشورهای زیر به طور کامل پشتیبانی می‌شوند:

source: Persian/Farsi (فارسی)
ar: الفارسية (فارسی)
fa: فارسی (فارسی)

source: Iran
ar: إيران
fa: ایران

source: United States
ar: الولايات المتحدة الأمريكية
fa: ایالات متحده آمریکا

source: United Kingdom
ar: المملكة المتحدة
fa: بریتانیا

source: Canada
ar: كندا
fa: کانادا

source: Australia
ar: أستراليا
fa: استرالیا

source: New Zealand
ar: نيوزيلندا
fa: نیوزیلند

source: South Africa
ar: جنوب أفريقيا
fa: آفریقای جنوبی

source: Ireland
ar: أيرلندا
fa: ایرلند

source: Russia
ar: روسيا
fa: روسیه

source: Ukraine
ar: أوكرانيا
fa: اوکراین

source: Belarus
ar: بيلاروسيا
fa: بلاروس

source: Kazakhstan
ar: كازاخستان
fa: قزاقستان

source: Kyrgyzstan
ar: قيرغيزستان
fa: قرقیزستان

source: Chinese (中文)
ar: الصينية (中文)
fa: چینی (中文)

source: China (Simplified)
ar: الصين (مبسطة)
fa: چین (ساده‌شده)

source: Taiwan (Traditional)
ar: تايوان (تقليدية)
fa: تایوان (سنتی)

source: Hong Kong
ar: هونغ كونغ
fa: هنگ کنگ

source: Singapore
ar: سنغافورة
fa: سنگاپور

source: Macau
ar: ماكاو
fa: ماکائو

source: Saudi Arabia
ar: المملكة العربية السعودية
fa: عربستان سعودی

source: Egypt
ar: مصر
fa: مصر

source: United Arab Emirates
ar: الإمارات العربية المتحدة
fa: امارات متحده عربی

source: Jordan
ar: الأردن
fa: اردن

source: Syria
ar: سوريا
fa: سوریه

source: Lebanon
ar: لبنان
fa: لبنان

source: Iraq
ar: العراق
fa: عراق

source: Kuwait
ar: الكويت
fa: کویت

source: Qatar
ar: قطر
fa: قطر

source: Bahrain
ar: البحرين
fa: بحرین

source: Oman
ar: عمان
fa: عمان

source: Yemen
ar: اليمن
fa: یمن

source: Palestine
ar: فلسطين
fa: فلسطین

source: Israel
ar: إسرائيل
fa: اسرائیل

source: Morocco
ar: المغرب
fa: مراکش

source: Algeria
ar: الجزائر
fa: الجزایر

source: Tunisia
ar: تونس
fa: تونس

source: Libya
ar: ليبيا
fa: لیبی

source: Sudan
ar: السودان
fa: سودان

source: Chad
ar: تشاد
fa: چاد

source: Mauritania
ar: موريتانيا
fa: موریتانی

source: Djibouti
ar: جيبوتي
fa: جیبوتی

source: Somalia
ar: الصومال
fa: سومالی

source: Comoros
ar: جزر القمر
fa: کومور

source: Eritrea
ar: إريتريا
fa: اریتره

source: Ethiopia
ar: إثيوبيا
fa: اتیوپی

source: South Sudan
ar: جنوب السودان
fa: سودان جنوبی

source: Automatic Language Detection
ar: الكشف التلقائي عن اللغة
fa: شناسایی خودکار زبان

source: The plugin automatically detects your WordPress language setting and adapts all interface elements, questions, and options accordingly. If your WordPress language is set to one of the supported languages, the plugin will automatically use that language for all text and interface elements.
ar: يكتشف المكون الإضافي تلقائيًا إعداد لغة ووردبريس الخاصة بك ويضبط جميع عناصر الواجهة والأسئلة والخيارات وفقًا لذلك. إذا كانت لغة ووردبريس الخاصة بك هي إحدى اللغات المدعومة، فسيستخدم المكون الإضافي تلك اللغة تلقائيًا لجميع النصوص وعناصر الواجهة.
fa: افزونه به طور خودکار زبان وردپرس شما را شناسایی می‌کند و تمام عناصر رابط کاربری، سوالات و گزینه‌ها را مطابق آن تنظیم می‌کند. اگر زبان وردپرس شما یکی از زبان‌های پشتیبانی‌شده باشد، افزونه به طور خودکار از آن زبان برای تمام متن‌ها و عناصر رابط کاربری استفاده خواهد کرد.

source: Summary of Steps:
ar: ملخص الخطوات:
fa: خلاصه مراحل:
fa_ir: خلاصه مراحل:

source: 1. Configure base questions → 2. Customize form appearance → 3. Manage characteristics → 4. Configure products → 5. Place form on site → 6. Test functionality
ar: 1. تكوين الأسئلة الأساسية → 2. تخصيص مظهر النموذج → 3. إدارة الخصائص → 4. تكوين المنتجات → 5. وضع النموذج على الموقع → 6. اختبار الوظائف
fa: ۱. سوالات پایه را تنظیم کنید → ۲. ظاهر فرم را سفارشی کنید → ۳. ویژگی‌ها را مدیریت کنید → ۴. محصولات را تنظیم کنید → ۵. فرم را در سایت قرار دهید → ۶. عملکرد را تست کنید
fa_ir: 1. سوالات پایه را پیکربندی کنید → 2. ظاهر فرم را طراحی کنید → 3. ویژگی‌ها را مدیریت کنید → 4. محصولات را پیکربندی کنید → 5. فرم را در سایت قرار دهید → 6. کارایی را آزمون کنید

source: Enable Plugin
ar: تفعيل الإضافة
fa: فعال‌سازی افزونه
fa_ir: فعال‌سازی افزونه

source: Custom Message
ar: رسالة مخصصة
fa: پیام سفارشی
fa_ir: پیام سفارشی

source: Primary Color
ar: اللون الأساسي
fa: رنگ اصلی افزونه
fa_ir: رنگ اصلی

source: Example: #8c0101 or rgba(140,1,1,1)
ar: مثال: #8c0101 أو rgba(140,1,1,1)
fa: مثال: #8c0101 یا rgba(140,1,1,1)
fa_ir: مثال: #8c0101 یا rgba(140,1,1,1)

source: Enter color code in HEX or RGBA format. (Example: #8c0101 or rgba(140,1,1,1))
fa: کد رنگ را به صورت HEX یا RGBA وارد کنید. (مثال: #8c0101 یا rgba(140,1,1,1))
fa_ir: رنگ را در فرمت HEX یا RGBA وارد کنید. (مثال: #8c0101 یا rgba(140,1,1,1))

source: Form Font Color
fa: رنگ فونت فرم
fa_ir: رنگ فونت فرم

source: #fff or #000 or rgba(255,255,255,1)
ar: #fff أو #000 أو rgba(255,255,255,1)
fa: #fff یا #000 یا rgba(255,255,255,1)
fa_ir: #fff یا #000 یا rgba(255,255,255,1)
